# Game Over - версия 2
# Показывает разные примеры работы со строками
import pyfiglet

print('Программа "Game Over" 2.0')
print('То же', 'самое', 'сообщение')
print('Только',
      'чучуть',
      'побольше')
print('Вот', end=" ")
print('оно...')
print(
        """_
        /  ___|    /   |    /   |/   || ____|
        | |       / /| |   / /|   /| || |__
        | |  _   / ___ |  / / |__/ | ||  __|
        | |_| | / /  | | / /       | || |___
        \_____//_/   |_|/_/        |_||_____|
          ____  _     _  _____   _____
        /  _  \| |   / /| ____| |  _  \
        | | | || |  / / | |__   | |_| |
        | | | || | / /  |  __|  |  _  /
        | |_| || |/ /   | |___  | | \ \
        \_____/|___/    |_____| |_|  \_\
        """
    )
result = pyfiglet.figlet_format("Game\nOver") 
print(result)

input("\nНажмите Enter, чтобы выйти.\n")