"""
Оператор Пример     Так же как
+	     сложение	4 + 5
—	     вычитание	8 — 3
*	     умножение	5 * 5
/	     деление	4 / 2
%	     остаток от деления	7 % 2
**	     возведение в степень	2 ** 3
//	     целочисленное деление	15 // 4
"""
# Текстовые задачи
# Демонстрирует математические операции
print("\nЕсли беременная самка бегемота массой 800 кгродит детеныша массой 40 кг.")
print("yj затем съел 20 кг корма, то сколько она будет после всего этого весить?")
input("Что бы узнать, нажмите Enter.")
print("800 - 40 + 20 = ", 800 - 40 + 20)

print("\nЕсли студент, возвращаеться с успешно сданного экзамена, на радостях")
print("купил каждому из шести друзей ро 3 бутылки пива, то сколько всего бутылок пива куплино?")
input("Что бы узнать, нажмите Enter.")
print("6 * 3 =", 6 * 3)

print("\nЕсли в ресторане вам с приятилями пренесли счет на 19 долларов(считая чаевые),")
print("и вы решились скинуться поровну на 4-х, то сколько придеться с каждого?")
input("Что бы узнать, нажмите Enter.")
print("19 / 4 = ", 19 / 4)

print("\nЕсли четверо пиратов найдут ларчик, в котором ровно 107 золотых монет, и")
print("решат разделить добычу поровну, то сколько целых момент достанеться каждому?")
input("Что бы узнать, нажмите Enter.")
print("107 // 4 =", 107 // 4)

print("\nЕсли те же самые четверо пиратов разделяет те же 107 монет из ларчика поровну,")
print("это сколько остаеться ничейных монет?")
input("Что бы узнать, нажмите Enter.")
print("107 % 4 = ", 107 % 4)

input("\nНажмите Enter, чтобы выйти.\n")